<template>
    <!-- 经销商模式配置-说明 -->
    <Dialog width="910" :title="$t('经销商模式配置说明')" top="10vh" :isShowBottomButton="false" @cancel="emits('close')">
        <div class="explain-box">
            <div class="small-box" :class="{'small-box-active': specialIndex.includes(index)}" v-for="(item,index) in explainData[explainType]"
                :key="index">
                <span class="label">{{item.title}}</span>
                <span class="text">{{item.text}}</span>
            </div>
        </div>
    </Dialog>
</template>

<script setup>
import { computed } from 'vue'
const emits = defineEmits(['close'])
const props = defineProps({
    explainType: {
        type: Number,
        default: 1
    }
})
const explainData = {
    1: [
        { title: $t('返佣计算（配置后不可修改切换）'), text: '' },
        { title: $t('返佣将针对：'), text: $t('首充分配条件、累计充值条件、下级邀请条件，VIP奖励，首充门槛条件五个类判断返佣；') },
        { title: $t('直属：'), text: $t('默认选择，只对经销商自己发展的成员，对自己返佣；') },
        { title: '', text: $t('如：计算a代理商的成员a1，a2...') },
        { title: $t('所有：'), text: $t('对商户配置的该总级经销商商户审核的一级，该经销商链路的全部下级返佣（包括下级成员）；') },
        { title: '', text: $t('如：a代理商链路，a发展的b，b发展的c，以此类推；') },
        { title: '', text: $t('当b自己产生数据（包括b的下级）对a返佣，当c自己产生数据（包括c的下级）对a返佣。') },
    ],
    2: [
        { title: $t('首充分配条件'), text: '' },
        { title: $t('首充门槛：'), text: $t('限制范围，整数1-1000（印尼对应扩大1000倍）；') },
        { title: '', text: $t('如配置5，则成员最低充值≥5才算有效；') },
        { title: $t('首充奖励：'), text: '' },
        { title: $t('按充值比例：'), text: $t('限制范围，最多一位小数，0.1-100（不可超过100%）；') },
        { title: '', text: $t('如配置比例1%，判断所选直属或所有下级链路首次充值100，则获得返佣奖励1；') },
        { title: $t('固定金额：'), text: $t('限制范围，最大两位小数，0.01-不可超过首充门槛；') },
        { title: '', text: $t('如配置5，则会员首次充值10，则获得返佣奖励5；') },
    ],
    3: [
        { title: $t('累计充值条件（奖励轮循）'), text: '' },
        { title: $t('累计充值：'), text: $t('限制范围，整数10-10000（印尼对应扩大1000倍）；') },
        { title: '', text: $t('如配置100，则自己的成员累计充值额度≥100才算有效；') },
        { title: $t('按充值比例：'), text: $t('限制范围，最多一位小数，0.1-100（不可超过100%）；') },
        { title: '', text: $t('如配置比例1%，会员每累计充值100，则获得返佣奖励1；') },
        { title: $t('固定金额：'), text: $t('限制范围，最大两位小数，0.01-累计充值条件上限；') },
        { title: '', text: $t('如配置5，则会员每累计充值100，则获得返佣奖励5；') },
        { title: '', text: $t('奖励轮循-每累计达到额度后可再次奖励，如会员充值150，满足充值100条件获得奖励，继续充值50再次满足100条件再次奖励。') },
    ],
    4: [
        { title: $t('下级邀请条件（奖励轮循）'), text: '' },
        { title: $t('下级邀请人数：'), text: $t('限制范围，整数1-100000；') },
        { title: $t('直属：'), text: $t('对直属发展的会员人数计算；') },
        { title: $t('所有：'), text: $t('对总级（商户审核的一级）所有下级链路所有下级人数计算；') },
        { title: '', text: $t('如配置100，则下级邀请人数（判断直属还是所有，直属：需自己的成员人数达到，所有：则整条链路，依次发展的下级人数）≥100才算有效；') },
        { title: $t('按充值比例：'), text: $t('无；') },
        { title: $t('固定金额：'), text: $t('限制范围，最多一位小数，0.1-1000（印尼对应扩大1000倍）；') },
        { title: '', text: $t('如配置50，下级邀请人数每达到100人，奖励50。') },
    ],
    5: [
        { title: $t('首充门槛条件（奖励轮循）'), text: '' },
        { title: $t('首充人数达到：'), text: $t('限制范围，整数1-1000；') },
        { title: $t('直属：'), text: $t('对直属发展的会员人数计算；') },
        { title: $t('所有：'), text: $t('对总级（商户审核的一级）所有下级链路所有下级人数计算；') },
        { title: '', text: $t('如配置50，判断所选直属或所有下级链路，则首充人数≥50人，才算有效；') },
        { title: $t('按充值比例：'), text: $t('无；') },
        { title: $t('固定金额：'), text: $t('0.1-1000（印尼对应扩大1000倍）；') },
        { title: '', text: $t('如配置5，则首充人数≥50人，则获得返佣奖励5。') },
    ],
    6: [
        { title: $t('三级分佣说明：'), text: $t('每个都可以算一级，无限极往下发展，但只可以获得三级返佣（二级，三级、四级）；') },

        { title: $t('首充金额：'), text: $t('限制范围，整数10-1000（印尼对应扩大1000倍）；') },
        { title: '', text: $t('如配置10，则需要下级成员首次充值≥10才算有效，可返佣；') },
        { title: $t('一级分佣：'), text: $t('由商户配置，二级对一级的返佣；') },
        { title: $t('按充值比例：'), text: $t('如配置比例1%，商户配置的二级经销商需对一级的返佣。') },

        { title: $t('累计充值三级分佣（奖励轮循）'), text: '' },
        { title: '', text: $t('如配置10，则需要下级单个成员的累计最低充值≥10才算有效，可返佣；') },
        { title: $t('一级分佣'), text: '' },
        { title: $t('按充值比例：'), text: $t('如配置比例1%，商户配置的二级经销商需对一级的返佣；') },
        { title: $t('固定金额：'), text: $t('无；') },
        { title: $t('下级返佣差额：'), text: $t('上级可以获得下级返佣；') },
        { title: '', text: $t('每个经销商都可以不断发展下级，最大获得三级的返佣。') },

        { title: $t('三级分佣奖励'), text: '' },
        { title: $t('返佣奖励：'), text: $t('经销商自己获得的返佣奖励；') },
        { title: '', text: $t('如商户对一级分佣30%，则一级自己成员充值100，给到一级自己贡献30；') },
        { title: '', text: $t('一级对二级分佣20%，则二级自己成员充值100，给到二级自己贡献20；') },
        { title: '', text: $t('二级对三级分佣10%，则三级自己成员充值100，给到三级自己贡献10；') },
        { title: $t('贡献奖励：'), text: $t('下级经销商（二级，三级）对自己贡献的奖励；') },
        { title: '', text: $t('如一级（自己）的比例30%，对二级分佣20%，则二级成员充值100，二级自己获得贡献20，给一级返佣10（30-20）；') },
        { title: '', text: $t('二级对三级分佣10%，则三级成员充值100，三级自己获得贡献10，给一级返佣20（30-10）。') },
    ],
    7: [
        { title: $t('VIP等级奖励（奖励轮循）'), text: '' },
        { title: '', text: $t('判断经销商判断所选直属或所有下级链路达到VIP等级的会员，可获得返佣；') },
        { title: $t('总充值：'), text: $t('限制范围，整数1-1000000（印尼对应扩大1000倍），按当前VIP等级内所有会员的总充值额度统计。') },
        { title: $t('总人数：'), text: $t('限制范围，整数1-100000；') },
        { title: $t('按总充值奖励：'), text: $t('限制范围，1-1000（印尼对应扩大1000倍）；') },
        { title: $t('按人数固定金额：'), text: $t('限制范围，1-1000（印尼对应扩大1000倍）。') },
    ],
}

const specialIndex = computed(() => {
    return props.explainType === 6 ? [1, 6, 13] : []
})
</script>

<style lang="scss">
.explain-box {
    display: flex;
    flex-direction: column;
    margin-bottom: 20px;
    .small-box {
        font-size: 16px;
        line-height: 24px;
        .label {
            color: #666;
        }
        .text {
            color: #999;
        }
        &--active {
            margin-top: 10px;
        }
    }
}
</style>
